In [27]:
import pandas as pd

list1 = [['한빛', '남자', 20, 180],
             ['한결', '남자', 21, 177],
             ['한라', '여자', 20, 160]]
col_names = ['이름', '성별', '나이', '키']
pd.DataFrame(list1, columns=col_names)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [15]:
import numpy as np

arr1 = np.array([['한빛', '남자', 20, 180],
             ['한결', '남자', 21, 177],
             ['한라', '여자', 20, 160]])
col_names = ['이름', '성별', '나이', '키']
pd.DataFrame(arr1, columns=col_names)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [23]:
list2 = [
    [1, 2016, 0.63, 3.75],
    [2, 2015, 0.70, 2.75],
    [3, 2015, 0.70, 3],
    [4, 2015, 0.70, 3.5],
    [5, 2015, 0.70, 3.5],
    [6, 2014, 0.70, 2.75],
    [7, 2014, 0.70, 3.5],
    [8, 2014, 0.70, 3.5],
]

col_names=['번호','년도','카카오 함유량','평점']
df = pd.DataFrame(list2, columns=col_names)
df

   번호    년도  카카오 함유량    평점
0   1  2016     0.63  3.75
1   2  2015     0.70  2.75
2   3  2015     0.70  3.00
3   4  2015     0.70  3.50
4   5  2015     0.70  3.50
5   6  2014     0.70  2.75
6   7  2014     0.70  3.50
7   8  2014     0.70  3.50

In [24]:
df.to_csv('chocolate.csv', header=True, index=False, encoding='utf-8')

In [28]:
df2 = pd.read_csv('chocolate.csv')
df2

   번호    년도  카카오 함유량    평점
0   1  2016     0.63  3.75
1   2  2015     0.70  2.75
2   3  2015     0.70  3.00
3   4  2015     0.70  3.50
4   5  2015     0.70  3.50
5   6  2014     0.70  2.75
6   7  2014     0.70  3.50
7   8  2014     0.70  3.50

In [29]:
df.to_json('chocolate.json', orient="records", force_ascii=False)

In [31]:

df.columns

Index(['번호', '년도', '카카오 함유량', '평점'], dtype='object')

In [32]:
# 통계정보확인
df.describe()

            번호           년도   카카오 함유량        평점
count  8.00000     8.000000  8.000000  8.000000
mean   4.50000  2014.750000  0.691250  3.281250
std    2.44949     0.707107  0.024749  0.388162
min    1.00000  2014.000000  0.630000  2.750000
25%    2.75000  2014.000000  0.700000  2.937500
50%    4.50000  2015.000000  0.700000  3.500000
75%    6.25000  2015.000000  0.700000  3.500000
max    8.00000  2016.000000  0.700000  3.750000

In [33]:
df.head() #데이터가 많을때 앞에서부터 5개씩 잘라서 보여줌

   번호    년도  카카오 함유량    평점
0   1  2016     0.63  3.75
1   2  2015     0.70  2.75
2   3  2015     0.70  3.00
3   4  2015     0.70  3.50
4   5  2015     0.70  3.50

In [34]:
df.tail() #데이터가 많을때 뒤에서부터 5개씩 잘라서 보여줌
#df.tail(3) 뒤에서부터 3개씩 default 기본값이 5개씩인거임 안에 숫자쓰면 그 갯수만큼 보여줌

   번호    년도  카카오 함유량    평점
3   4  2015      0.7  3.50
4   5  2015      0.7  3.50
5   6  2014      0.7  2.75
6   7  2014      0.7  3.50
7   8  2014      0.7  3.50

In [35]:
df3 = pd.read_csv('student.csv', header=None)
df3

     0   1   2    3
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [36]:
df3[df3[2].isin([21,23])]

     0   1   2    3
2  배규민  남자  23  179
3  고고림  남자  21  182

In [37]:
df3[(df3[1] == '여자') & (df3[3]> 160)]

     0   1   2    3
1  이가원  여자  24  162
5  이보람  여자  26  163
7  오다현  여자  24  172

In [45]:
#28세 이상이거나 남자인 사람를 조회하시오.
df3[(df3[1]=='남자') | (df3[2] >= 28)]

     0   1   2    3
0  허준호  남자  30  183
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160

In [46]:
# 이름에 봄이 들어간 사람을 조회하시오( 문자열은 str.__contains__('찾는문자 ')) 함수를 사용하면 포함여부 알수있다
df3[df3[0].str.contains('봄')]

     0   1   2    3
4  이새봄  여자  28  160

In [47]:
df3[df3[0].str.startswith('이')]

     0   1   2    3
1  이가원  여자  24  162
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157

In [48]:
df3[df3[0].str.endswith('람')]

     0   1   2    3
5  이보람  여자  26  163

In [49]:
# pandas 접근법
# loc : location
# iloc : index location
df3.iloc[3]

0    고고림
1     남자
2     21
3    182
Name: 3, dtype: object

In [50]:
df3.loc[4,3] = df3.loc[4,3] +5  #키를 5센치 더해준다
df3

     0   1   2    3
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  165
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [52]:
df3.iloc[1:4,3] =['없음']*3
df3

/tmp/ipykernel_25065/1155913213.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['없음', '없음', '없음']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3.iloc[1:4,3] =['없음']*3

     0   1   2    3
0  허준호  남자  30  183
1  이가원  여자  24   없음
2  배규민  남자  23   없음
3  고고림  남자  21   없음
4  이새봄  여자  28  165
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [53]:
df3.iloc[1:4, 3] = [162, 179, 182]
df3

     0   1   2    3
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  165
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [54]:
#열 생성
df3[4]=df3[2] *1000
df3

     0   1   2    3      4
0  허준호  남자  30  183  30000
1  이가원  여자  24  162  24000
2  배규민  남자  23  179  23000
3  고고림  남자  21  182  21000
4  이새봄  여자  28  165  28000
5  이보람  여자  26  163  26000
6  이루리  여자  24  157  24000
7  오다현  여자  24  172  24000

In [56]:
replace_condition = {1: {'남자':0, '여자': 1}}
df4 = df3.replace(replace_condition)
df4

     0  1   2    3      4
0  허준호  0  30  183  30000
1  이가원  1  24  162  24000
2  배규민  0  23  179  23000
3  고고림  0  21  182  21000
4  이새봄  1  28  165  28000
5  이보람  1  26  163  26000
6  이루리  1  24  157  24000
7  오다현  1  24  172  24000

In [1]:
# 성별로 키 평균
mean_by_gender = df4.groupby(by=1, as_index=False)[3].mean()
mean_by_gender.rename(columns={1:'성별',3:'평균키'}, inplace=True)

# 성별 키의 표준편차
std_by_gender = df4.groupby(by=1, as_index=False)[3].std()
std_by_gender.rename(columns={1:'성별',3:'표준편차'}, inplace=True)

new_df= pd.merge(mean_by_gender,std_by_gender)
new_df

NameError: name 'df4' is not defined